<?php

$config = [
    // 双色球规则
    'two_ball_config' => [
        'red' => 6,
        'blue' => 1,
        'max_red' => 20,
        'max_blue' => 16,
        'red_number' => ['01', '02', '03', '04', '05', '06', '07', '08', '09', '10',
            '11', '12', '13', '14', '15', '16', '17', '18', '19', '20', '21', '22',
            '23', '24', '25', '26', '27', '28', '29', '30', '31', '32', '33'
        ],
        'blue_number' => ['01', '02', '03', '04', '05', '06', '07',
            '08', '09', '10', '11', '12', '13', '14', '15', '16'
        ]
    ],

    // 大乐透规则
    'grand_lotto_config' => [
        'red' => 5,
        'blue' => 2,
        'max_red' => 18,
        'max_blue' => 12,
        'red_number' => ['01', '02', '03', '04', '05', '06', '07', '08', '09', '10',
            '11', '12', '13', '14', '15', '16', '17', '18', '19', '20', '21', '22',
            '23', '24', '25', '26', '27', '28', '29', '30', '31', '32', '33', '34', '35'
        ],
        'blue_number' => ['01', '02', '03', '04', '05', '06', '07',
            '08', '09', '10', '11', '12'
        ]
    ],

    // 福彩3D、排列3
    'lucky_three_config' => [
        'select_direct' => [
            'position' => 1,
            'max_position' => 10,
            'position_number' => ['0', '1', '2', '3', '4', '5', '6', '7', '8', '9'],
        ],
        'select_three' => [
            'select' => 2,
            'max_select' => 10,
            'select_number' => ['0', '1', '2', '3', '4', '5', '6', '7', '8', '9'],
        ],
        'select_six' => [
            'select' => 3,
            'max_select' => 10,
            'select_number' => ['0', '1', '2', '3', '4', '5', '6', '7', '8', '9'],
        ],
    ],

    // 排列5
    'range_five_config' => [
        'position' => 1,
        'max_position' => 10,
        'position_number' => ['0', '1', '2', '3', '4', '5', '6', '7', '8', '9'],
    ],

    // 七乐彩规则
    'seven_music_config' => [
        'red' => 7,
        'max_red' => 16,
        'red_number' => ['01', '02', '03', '04', '05', '06', '07', '08',
            '09', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19',
            '20', '21', '22', '23', '24', '25', '26', '27', '28', '29', '30'
        ],
    ],

    // 七星彩规则
    'seven_star_config' => [
        'position' => 1,
        'special' => 1,
        'max_position' => 10,
        'max_special' => 14,
        'position_number' => ['0', '1', '2', '3', '4', '5', '6', '7', '8', '9'],
        'special_number' => ['0', '1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12', '13', '14'],
    ],

    // 验证码等待秒数
    'sms_code_wait_second' => 60,

    // 每日短信总量
    'sms_daily_all_limit' => 5000,

    // 单个手机号短信总量
    'sms_single_limit' => 1000,

    // 每日单个手机号短信总量
    'sms_daily_single_limit' => 100,

    // 检查支付结果频率(每/秒), 默认每2秒检查一次
    'check_pay_rate' => 2,

    // 支付超时时间(秒), 默认为10分钟
    'pay_timeout' => 600,

    // 系统消息的 redis 队列
    'message_remind' => 'hc8:message_remind',

    // 消息推送的 redis 队列
    'message_push' => 'hc8:message_push',

    // 不中退的订单id redis 队列
    'retreat_order' => 'hc8:retreat_order_info',
];

return $config;
